
A simple python wrapper for use with Microsoft Exchange Web Services (EWS). Originally developed for use with ASynK - http://karra-asynk.appspot.com/


* Status


** Sun Mar 30 18:35:00 IST 2014

   Able to discover all the contact folders and also create new ones.

** Thu Mar 27 22:34:10 IST 2014

   After struggling with SUDS and a bunch of random assorted soap clients,
   decided to just go with direct http, and now I am able to fetch basic
   details from the server! Next steps - parsing the details as well as
   fetching more important info.

** Sat Mar 15 17:17:01 IST 2014

   Developing the autodiscovery service is going to be a very difficult
   affair. There are many deployment scenaros possible as made clear in the
   documentation and there's no way to validate the code in all the
   scenarios. So for now the autodiscover code is incomplete and, well, a bit
   shoddy. Sorry.

* Links to important reference docs

- http://msdn.microsoft.com/en-us/library/office/jj900168.aspx Start Using Web Services in Exchange

* Time Tracker

** Mar 2014
   CLOCK: [2014-03-30 Sun 17:22]--[2014-03-30 Sun 18:35] =>  1:13
   CLOCK: [2014-03-30 Sun 16:56]--[2014-03-30 Sun 17:16] =>  0:20
   CLOCK: [2014-03-30 Sun 14:16]--[2014-03-30 Sun 14:23] =>  0:07
   CLOCK: [2014-03-30 Sun 13:30]--[2014-03-30 Sun 13:36] =>  0:06
   CLOCK: [2014-03-30 Sun 12:27]--[2014-03-30 Sun 12:29] =>  0:02
   CLOCK: [2014-03-30 Sun 07:44]--[2014-03-30 Sun 10:22] =>  2:38
   CLOCK: [2014-03-27 Thu 17:51]--[2014-03-27 Thu 18:01] =>  0:10
   CLOCK: [2014-03-27 Thu 17:45]--[2014-03-27 Thu 17:47] =>  0:02
   CLOCK: [2014-03-16 Sun 10:01]--[2014-03-16 Sun 15:53] =>  5:52
   CLOCK: [2014-03-16 Sun 09:32]--[2014-03-16 Sun 10:01] =>  0:29
   CLOCK: [2014-03-15 Sat 16:18]--[2014-03-15 Sat 17:16] =>  0:58
   CLOCK: [2014-03-15 Sat 15:24]--[2014-03-15 Sat 15:26] =>  0:02
   CLOCK: [2014-03-05 Wed 19:19]--[2014-03-05 Wed 19:39] =>  0:20
   CLOCK: [2014-03-05 Wed 17:01]--[2014-03-05 Wed 17:43] =>  0:42
   CLOCK: [2014-03-05 Wed 16:31]--[2014-03-05 Wed 16:51] =>  0:20
   CLOCK: [2014-03-05 Wed 16:10]--[2014-03-05 Wed 16:30] =>  0:20
   CLOCK: [2014-03-05 Wed 15:05]--[2014-03-05 Wed 16:00] =>  0:55
   CLOCK: [2014-03-05 Wed 14:03]--[2014-03-05 Wed 14:23] =>  0:20
   CLOCK: [2014-03-05 Wed 12:35]--[2014-03-05 Wed 13:03] =>  0:28
   CLOCK: [2014-03-05 Wed 11:41]--[2014-03-05 Wed 12:01] =>  0:20
   CLOCK: [2014-03-05 Wed 11:23]--[2014-03-05 Wed 11:30] =>  0:07

